// Bubble Sort হলো একটা sorting algorithm যা লিস্ট বা অ্যারের উপাদানগুলোকে একে একে পাশের এলিমেন্টের সাথে তুলনা করে এবং ভুল অর্ডারে থাকলে তাদের swap করে।
// এটা ধাপে ধাপে বড় (বা ছোট) এলিমেন্টগুলোকে “bubble” এর মতো উপরে (বা নিচে) তুলে আনে — তাই এর নাম Bubble Sort।

// কিভাবে কাজ করে
// প্রথম থেকে শুরু করে পাশের দুইটি এলিমেন্ট তুলনা করো।

// যদি তারা ভুল অর্ডারে থাকে (যেমন ascending চাইলে বড় আগে চলে এসেছে), তবে তাদের swap করো।

// একবারে লুপ শেষ হলে সবচেয়ে বড় এলিমেন্টটি অ্যারের একদম শেষে চলে যাবে।

// এই প্রক্রিয়া বাকি অংশের জন্য পুনরাবৃত্তি করো, যতক্ষণ পর্যন্ত সব element sort না হয়।
// ----------------------------------------------------------------------
// function bubbleSort(arr) {
//   let n = arr.length;
//   for (let i = 0; i < n-1; i++) {
//     for (let j = 0; j < n-i-1; j++) {
//       if (arr[j] > arr[j+1]) {
//         // Swap
//         [arr[j], arr[j+1]] = [arr[j+1], arr[j]];
//       }
//     }
//   }
//   return arr;
// }

// console.log(bubbleSort([5, 1, 4, 2, 8]));

// ----------------------------------------------------
function bubbleSort(arr) {
  for (let i = 0; i < arr.length - 1; i++) {
    for (let j = 0; j < arr.length - 1 - i; j++) {
      if (arr[j] > arr[j + 1]) {
        [arr[j], arr[j + 1]] = [arr[j + 1], arr[j]];
      }
    }
  }
  return arr;
}
console.log(bubbleSort([5, 3, 8, 4, 2]));
// [2, 3, 4, 5, 8];
